chtMultiregionFoam/fvSchemes_expt_case/constant/oil/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/oil/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    maxY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       259451;
    }

    minX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       260351;
    }

    maxX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       261251;
    }

    minY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       262151;
    }

    minZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       263051;
    }

    maxZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       263951;
    }

    oil_to_sphere
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          24344;
        startFace       264851;
        sampleMode      nearestPatchFace;
        sampleRegion    sphere;
        samplePatch     sphere_to_oil;
    }

)


// ************************************************************************* //
